
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 C语言的起源 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter02.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    第一章 初始C语言
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="chapter01.html">
            
                <a href="chapter01.html">
            
                    
                    1.1 C语言的起源
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="chapter02.html">
            
                <a href="chapter02.html">
            
                    
                    1.2 C语言的标准
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    第二章 C语言概述
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" >
            
                <span>
            
                    
                    2.1
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" >
            
                <span>
            
                    
                    2.2
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>
	<!-- drawream2020.06.11 23:24 -->
    <li>
        <a href="https://www.agoam.com/notebook" target="blank" class="gitbook-link">
            <!-- Published with GitBook -->
	           <i class="fa fa-arrow-circle-o-left"></i> 返回博客
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >1.1 C语言的起源</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#xA7;-11-c&#x8BED;&#x8A00;&#x7684;&#x8D77;&#x6E90;">&#xA7; 1.1 C&#x8BED;&#x8A00;&#x7684;&#x8D77;&#x6E90;</h3>
<p>c&#x8BED;&#x8A00;&#x7684;&#x4EA7;&#x751F;&#x7ADF;&#x7136;&#x6E90;&#x4E8E;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p>1969&#x5E74;&#xFF0C;&#x901A;&#x7528;&#x7535;&#x6C14;&#x3001;&#x9EBB;&#x7EF3;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x548C;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x8054;&#x5408;&#x521B;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x9879;&#x76EE;---Multics&#x5DE5;&#x7A0B;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x7684;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x663E;&#x7136;&#x9047;&#x5230;&#x4E86;&#x9EBB;&#x70E6;&#xFF1A;&#x5B83;&#x4E0D;&#x4F46;&#x65E0;&#x6CD5;&#x4EA4;&#x4ED8;&#x539F;&#x5148;&#x6240;&#x627F;&#x8BFA;&#x7684;&#x5FEB;&#x901F;&#x800C;&#x4FBF;&#x6377;&#x7684;&#x5728;&#x7EBF;&#x7CFB;&#x7EDF;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x4E00;&#x70B9;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x6CA1;&#x6709;&#x5F04;&#x51FA;&#x6765;&#x3002;&#x867D;&#x7136;&#x5F00;&#x53D1;&#x5C0F;&#x7EC4;&#x52C9;&#x5F3A;&#x8BA9;Multics&#x5F00;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x8FD8;&#x662F;&#x9677;&#x5165;&#x4E86;&#x6CE5;&#x6DD6;&#xFF0C;&#x5C31;&#x50CF;IBM&#x5728;OS/360&#x4E0A;&#x9762;&#x4E00;&#x6837;&#x3002;&#x4ED6;&#x4EEC;&#x8BD5;&#x56FE;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5DE8;&#x5927;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x80FD;&#x591F;&#x5E94;&#x7528;&#x4E8E;&#x89C4;&#x6A21;&#x5F88;&#x5C0F;&#x7684;&#x786C;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;Multics&#x6210;&#x4E86;&#x603B;&#x7ED3;&#x5DE5;&#x7A0B;&#x6559;&#x8BAD;&#x7684;&#x5B9D;&#x5E93;&#xFF0C;&#x4F46;&#x5B83;&#x540C;&#x65F6;&#x4E5F;&#x6210;&#x4E3A;C&#x8BED;&#x8A00;&#x4F53;&#x73B0;&#x201C;&#x5C0F;&#x65E2;&#x662F;&#x7F8E;&#x201D;&#x94FA;&#x5E73;&#x4E86;&#x9053;&#x8DEF;&#x3002;</p>
<h4 id="&#x63D2;&#x5165;&#x6807;&#x9898;&#x6D4B;&#x8BD5;">&#x63D2;&#x5165;&#x6807;&#x9898;&#x6D4B;&#x8BD5;</h4>
<p>&#x5F53;&#x5FC3;&#x7070;&#x610F;&#x51B7;&#x7684;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x4E13;&#x5BB6;&#x64A4;&#x79BB;Multics&#x5DE5;&#x7A0B;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x53C8;&#x53BB;&#x5BFB;&#x627E;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x540D;&#x53EB;Ken&#x2002;Thompson&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4ED6;&#x4E3A;&#x6B64;&#x597D;&#x51E0;&#x6B21;&#x5411;&#x8D1D;&#x5C14;&#x7BA1;&#x7406;&#x5C42;&#x63D0;&#x8BAE;&#xFF0C;&#x4F46;&#x5747;&#x906D;&#x5426;&#x51B3;&#x3002;&#x5728;&#x7B49;&#x5F85;&#x5B98;&#x65B9;&#x6279;&#x51C6;&#x65F6;&#xFF0C;Thompson&#x548C;&#x4ED6;&#x7684;&#x540C;&#x4E8B;Dennis&#x2002;Ritchie&#x81EA;&#x5A31;&#x81EA;&#x4E50;&#xFF0C;&#x628A;Thompson&#x7684;&#x201C;&#x592A;&#x7A7A;&#x65C5;&#x884C;&#x201D;&#x8F6F;&#x4EF6;&#x79FB;&#x690D;&#x5230;&#x4E0D;&#x592A;&#x5E38;&#x7528;&#x7684;PDP-7&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;&#x592A;&#x7A7A;&#x65C5;&#x884C;&#x8F6F;&#x4EF6;&#x6A21;&#x62DF;&#x592A;&#x9633;&#x7CFB;&#x4E3B;&#x8981;&#x661F;&#x4F53;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x663E;&#x793A;&#x5728;&#x56FE;&#x5F62;&#x5C4F;&#x5E55;&#x4E0A;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x67B6;&#x822A;&#x5929;&#x98DE;&#x673A;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x98DE;&#x884C;&#x5E76;&#x964D;&#x843D;&#x5230;&#x5404;&#x4E2A;&#x884C;&#x661F;&#x4E0A;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;Thompson&#x52A0;&#x7D27;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E3A;PDP-7&#x7F16;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x6613;&#x7684;&#x65B0;&#x578B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x6BD4;Multics&#x7B80;&#x5355;&#x5F88;&#x591A;&#xFF0C;&#x4E5F;&#x8F7B;&#x4FBF;&#x5F88;&#x591A;&#x3002;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x7528;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x3002;Brian&#x2002;Kernighan&#x5728;1970&#x5E74;&#x7ED9;&#x5B83;&#x53D6;&#x540D;&#x4E3A;Unix&#x3002;</p>
<p>&#x662F;&#x5148;&#x7528;c&#x8BED;&#x8A00;&#x8FD8;&#x662F;&#x5148;&#x6709;Unix&#x5462;&#xFF1F;&#x8BF4;&#x8D77;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x5148;&#x6709;&#x9E21;&#x8FD8;&#x662F;&#x5148;&#x8981;&#x86CB;&#x7684;&#x5957;&#x5957;&#x4E2D;&#x3002;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;Unix&#x6BD4;c&#x8BED;&#x8A00;&#x51FA;&#x73B0;&#x7684;&#x65E9;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;Unix&#x7684;&#x7CFB;&#x7EDF;&#x65F6;&#x95F4;&#x662F;&#x4ECE;1970&#x5E74;1&#x6708;1&#x65E5;&#x8D77;&#x6309;&#x79D2;&#x8BA1;&#x7B97;&#x7684;&#x3002;&#x7528;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7F16;&#x5199;Unix&#x663E;&#x5F97;&#x5F88;&#x7B28;&#x62D9;&#xFF0C;&#x5728;&#x7F16;&#x5236;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x65F6;&#x6D6A;&#x8D39;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x7CFB;&#x7EDF;&#x96BE;&#x4EE5;&#x8C03;&#x8BD5;&#xFF0C;&#x7406;&#x89E3;&#x8D77;&#x6765;&#x4E5F;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x5728;&#x7528;Fortran&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x756A;&#x7B80;&#x77ED;&#x800C;&#x53C8;&#x4E0D;&#x6210;&#x529F;&#x7684;&#x5C1D;&#x8BD5;&#x540E;&#xFF0C;Thompson&#x521B;&#x5EFA;&#x4E86;B&#x8BED;&#x8A00;&#x3002;&#x4F46;&#x662F;&#xFF0C;B&#x8BED;&#x8A00;&#x4ECE;&#x6765;&#x4E0D;&#x66FE;&#x771F;&#x6B63;&#x6210;&#x529F;&#x8FC7;&#xFF0C;&#x56E0;&#x4E3A;&#x786C;&#x4EF6;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x9650;&#x5236;&#xFF0C;&#x5B83;&#x53EA;&#x5141;&#x8BB8;&#x653E;&#x7F6E;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x7531;&#x6B64;&#x4EA7;&#x751F;&#x7684;&#x4F4E;&#x6548;&#x963B;&#x788D;&#x4E86;&#x4F7F;&#x7528;B&#x8BED;&#x8A00;&#x8FDB;&#x884C;Unix&#x81EA;&#x8EAB;&#x7684;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x3002;</p>
<p>&#x5F53;1970&#x5E74;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x8F6C;&#x79FB;&#x5230;PDP-11&#x4EE5;&#x540E;&#xFF0C;&#x65E0;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5F88;&#x5FEB;&#x5C31;&#x663E;&#x5F97;&#x4E0D;&#x5408;&#x65F6;&#x5B9C;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x5904;&#x7406;&#x5668;&#x4EE5;&#x786C;&#x4EF6;&#x652F;&#x6301;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x957F;&#x5EA6;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E3A;&#x7279;&#x8272;&#xFF0C;&#x800C;B&#x8BED;&#x8A00;&#x65E0;&#x6CD5;&#x8868;&#x8FBE;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x6548;&#x7387;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E5F;&#x8FEB;&#x4F7F;Thompson&#x5728;PDP-11&#x4E0A;&#x91CD;&#x65B0;&#x7528;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x4E86;Unix&#x3002;Dennis&#x2002;Ritchie&#x5229;&#x7528;PDP-11&#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#xFF0C;&#x521B;&#x7ACB;&#x4E86;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x591A;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x6548;&#x7387;&#x7684;&#x201C;New&#x2002;B&#x201D;&#xFF08;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x5F88;&#x5FEB;&#x53D8;&#x6210;&#x4E86;&#x201C;C&#x201D;&#xFF09;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x91C7;&#x7528;&#x4E86;&#x7F16;&#x8BD1;&#x6A21;&#x5F0F;&#x800C;&#x4E0D;&#x662F;&#x89E3;&#x91CA;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x5F15;&#x5165;&#x4E86;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x3002;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x4F7F;&#x7528;&#x524D;&#x5FC5;&#x987B;&#x58F0;&#x660E;&#x3002;</p>
<p>c&#x8BED;&#x8A00;&#x7684;&#x65E9;&#x671F;&#x4F53;&#x9A8C;</p>
<p>c&#x8BED;&#x8A00;&#x6392;&#x65A5;&#x5F3A;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x95F4;&#x8D4B;&#x503C;&#x3002;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x52A0;&#x5165;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E8B;&#x540E;&#x8BF8;&#x845B;&#xFF0C;&#x4ECE;&#x672A;&#x5728;&#x53EF;&#x80FD;&#x6027;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8FC7;&#x8BA4;&#x771F;&#x7684;&#x8BC4;&#x4F30;&#x548C;&#x4E25;&#x683C;&#x7684;&#x6D4B;&#x8BD5;&#x3002;&#x65F6;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;&#x8BB8;&#x591A;C&#x7A0B;&#x5E8F;&#x5458;&#x4ECD;&#x7136;&#x8BA4;&#x4E3A;&#x201C;&#x5F3A;&#x7C7B;&#x578B;&#x201D;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x6572;&#x51FB;&#x952E;&#x76D8;&#x7684;&#x65E0;&#x7528;&#x529F;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E4B;&#x5916;&#xFF0C;c&#x8BED;&#x8A00;&#x7684;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x7279;&#x6027;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x7F16;&#x8BD1;&#x5668;&#x8BBE;&#x8BA1;&#x8005;&#x800C;&#x5EFA;&#x7ACB;&#x7684;&#xFF08;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5462;&#xFF1F;&#x5F00;&#x59CB;&#x51E0;&#x5E74;c&#x8BED;&#x8A00;&#x7684;&#x4E3B;&#x8981;&#x5BA2;&#x6237;&#x5C31;&#x662F;&#x90A3;&#x4E9B;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#xFF09;&#x3002;&#x6839;&#x636E;&#x7F16;&#x8BD1;&#x5668;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x601D;&#x8DEF;&#x800C;&#x53D1;&#x5C55;&#x5F62;&#x6210;&#x7684;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x6709;&#xFF1A;</p>
<ul>
<li><p>&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x4ECE;0&#x800C;&#x4E0D;&#x662F;1&#x5F00;&#x59CB;&#x3002;</p>
</li>
<li><p>c&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x76F4;&#x63A5;&#x4E0E;&#x5E95;&#x5C42;&#x786C;&#x4EF6;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</p>
</li>
<li><p>auto&#x5173;&#x952E;&#x5B57;&#x663E;&#x7136;&#x662F;&#x6446;&#x8BBE;&#x3002;</p>
</li>
<li><p>&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#x540D;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x6307;&#x9488;&#x3002;</p>
</li>
<li><p>float&#x88AB;&#x81EA;&#x52A8;&#x6269;&#x5C55;&#x4E3A;double&#x3002;</p>
</li>
<li><p>&#x4E0D;&#x5141;&#x8BB8;&#x5D4C;&#x5957;&#x51FD;&#x6570;&#xFF08;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x5305;&#x542B;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#xFF09;</p>
</li>
<li><p>register&#x5173;&#x952E;&#x5B57;</p>
</li>
</ul>
<p>&#x4E3A;&#x4E86;c&#x7F16;&#x8BD1;&#x5668;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x65B9;&#x4FBF;&#x800C;&#x5EFA;&#x7ACB;&#x7684;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x3002;&#x8FD9;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x574F;&#x4E8B;&#xFF0C;&#x5B83;&#x5927;&#x5927;&#x7B80;&#x5316;&#x4E86;c&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x4E14;&#x901A;&#x8FC7;&#x56DE;&#x907F;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x8BED;&#x8A00;&#x8981;&#x7D20;&#xFF0C;c&#x8BED;&#x8A00;&#x66F4;&#x5BB9;&#x6613;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E14;&#x6548;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#x3002;</p>
<p>&#x548C;&#x5176;&#x5B83;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;c&#x8BED;&#x8A00;&#x6709;&#x4E00;&#x4E2A;&#x6F2B;&#x957F;&#x7684;&#x8FDB;&#x5316;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x76EE;&#x524D;&#x8FD9;&#x4E2A;&#x5F62;&#x5F0F;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x7ECF;&#x5386;&#x4E86;&#x8BB8;&#x591A;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x3002;&#x5B83;&#x5386;&#x7ECF;&#x591A;&#x5E74;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x8FDB;&#x5316;&#x4E3A;&#x4E00;&#x79CD;&#x7ECF;&#x8FC7;&#x5927;&#x91CF;&#x5B9E;&#x9A8C;&#x548C;&#x6D4B;&#x8BD5;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;c&#x8BED;&#x8A00;&#x7F16;&#x8BD1;&#x5668;&#x5927;&#x7EA6;&#x51FA;&#x73B0;&#x5728;1970&#x5E74;&#x3002;&#x65F6;&#x5149;&#x834F;&#x82D2;&#xFF0C;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x6839;&#x57FA;&#x7684;Unix&#x7CFB;&#x7EDF;&#x5F97;&#x5230;&#x4E86;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;c&#x8BED;&#x8A00;&#x4E5F;&#x968F;&#x4E4B;&#x8301;&#x58EE;&#x6210;&#x957F;&#x3002;&#x5B83;&#x5BF9;&#x76F4;&#x63A5;&#x7531;&#x786C;&#x4EF6;&#x652F;&#x6301;&#x7684;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7684;&#x5F3A;&#x8C03;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x6781;&#x9AD8;&#x7684;&#x6548;&#x7387;&#x548C;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x4E5F;&#x5E2E;&#x52A9;&#x4E86;Unix&#x83B7;&#x5F97;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6210;&#x529F;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x5185;&#x5BB9;&#xFF0C;&#x5F85;&#x66F4;&#x65B0;&#x3002;&#x3002;&#x3002;</p>
<h3 id="&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;">&#x53C2;&#x8003;&#x6587;&#x732E;&#xFF1A;</h3>
<ol>
<li><a href="https://zhuanlan.zhihu.com/p/65728480" target="_blank">https://zhuanlan.zhihu.com/p/65728480</a></li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="chapter02.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1.2 C语言的标准">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 C语言的起源","level":"1.2.1","depth":2,"next":{"title":"1.2 C语言的标准","level":"1.2.2","depth":2,"path":"chapter02.md","ref":"chapter02.md","articles":[]},"previous":{"title":"第一章 初始C语言","level":"1.2","depth":1,"ref":"","articles":[{"title":"1.1 C语言的起源","level":"1.2.1","depth":2,"path":"chapter01.md","ref":"chapter01.md","articles":[]},{"title":"1.2 C语言的标准","level":"1.2.2","depth":2,"path":"chapter02.md","ref":"chapter02.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter01.md","mtime":"2020-06-12T06:55:17.921Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-06-12T08:18:59.280Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    

    </body>
</html>

